[
    {
        "year":"2022",
        "data": [
            {
            "date":"15th March, 2022",
            "image":"/assets/events/orientation2022.png",
            "event_name":"Orientation",
            "description":"The ISE Student Club Orientation was conducted on 15th March, 2022. It was held  in Auditorium 1 in the new Academic block at 1:30pm. Around 130 students attended  the event including the first and 2nd year students."
             },
             {
                "date":"14th March 2022",
                "image":"/assets/events/womensday.png",
                "event_name":"Women's Day",
                "description":"The I.S.E Student Club organized an event for the  female faculty of ISE department on the occasion of Women’s day on March 14th.This was the third  event conducted by the ISE Student Club in the year 2022. "
             },
             {
                "date":"19th March 2022",
                "image":"/assets/events/3uno4.jpeg",
                "event_name":"3.UNO 4",
                "description":"This event was conducted during the Simply Pi Day event The coordinators of the event were Riya Yadav (ISE, 5th sem) and Anushka R Dongal(ISE, 5th sem).The game was a riveting combination of two favorite games, UNO and Charades. "
            },
             {
                "date":"25th April 2022",
                "image":"/assets/events/peer.jpeg",
                "event_name":"PSP Peer Learning Module-1",
                "description":"I.S.E Student Club of B.M.S. College of Engineering organized a Peer Learning Module on C Programming on 25th and 26th of April, 2022 for 1st year Undergraduate students .The programme was held in offline mode.This two day workshop covered basic theoretical C programming concepts like looping and iterations, arrays, etc. Nearly 20 participants showed up each day."
            },
           
           {
              "date":"7th May 2022",
              "image":"/assets/events/technovate.png",
              "event_name":"Technovate",
              "description":"The ISE Student Club in collaboration with IEEE Student chapter conducted Technovate,a hands-on IoT workshop by the founder-CEO of GND solutions, Mr.Venkata Siva Reddy on 7th May 2022, from 9:30 to 1 o’clock.The event was targeted to third year students of technical and circuit branches with 38 registration with interest in IOT and embedded systems."
          },
          {
            "date":"23th May,2022",
            "image":"/assets/iselogo.png",
            "event_name":"Meme Showdown",
            "description":"Meme Showdown was an Utsav pre-event that was conducted on 23rd of May, 2022. The event was conducted online via google meet. 14 people from different colleges took part in this event. "
        },
        {
             "date":"29th May 2022",
             "image":"/assets/events/pc.png",
             "event_name":"PC Building Competetion",
             "description":"PC Building Competition was held on May 29, 2022. It was conducted in two rounds; first round was the virtual PC Building round in which the participants had to build a virtual PC using a simulator and the second one was building the PC with actual hardware components provided by us. We had received participation of nearly 35 teams, 5 of which made it to the second round. Qualification to the second round was purely based on the submissions of the first round. "
         },
         {
            "date":"28th May,2022",
            "image":"/assets/events/vf.png",
            "event_name":"Vector Flow",
            "description":"Vector Flow, an online graphic designing event, was held on 28th May,2022. The event commenced at 11.15 AM. The topic for the event was announced online by conducting a Google Meet. A suitable scenario was provided and participants were required to submit their designs within 3 hours."
        },
        
       {
          "date":"28th May,2022",
          "image":"/assets/events/fof.jpg",
          "event_name":"Flinch or Find",
          "description":"Flinch or Find is a event inspired by the games in the James Cordon and Jimmy Fallon show. Participants started by playing a game of chance to decide what game they will be led to - Flinch or Find.Flinch: A game with a whole lot of spine tingling ways to make the participant Flinch"
      }
        ]
    },
    {
        "year":"2021",
        "data": [
            {
            "date":"9th  August, 2021",
            "image":"/assets/events/orientation2021.jpeg",
            "event_name":"Orientation",
            "description":"The ISE Student Club Orientation was conducted on 9th  August, 2021. It was held  online through the platform  GoToMeetings at  1pm. Around 130 students attended  the event.It was followed by a brief introduction of the core committee and the organizing committee of the year 2021. The crowd was entertained by performances by 1st year students  Kshama Bhatt and Aditi Shankarnarayan.2nd year."
             },
             {
                "date":"14th August 2021",
                "image":"/assets/events/shark_tank.png",
                "event_name":"Shark Tank",
                "description":"The I.S.E Student Club organized a non-technical event based on the reality television series Shark Tank. It allowed young entrepreneurs to make business presentations to a panel of three investors or sharks who decide whether to invest in their company."
             },
             {
                "date":"8th October 2020",
                "image":"/assets/events/runtime.jpeg",
                "event_name":"Runtime Terror ",
                "description":"The I.S.E Student Club organized a Reverse Coding Contest  where the participants had to solve  competitive programming challenges given to them in a programming language of their choice. The event was conducted on 8th October 2021."
            },
            {
               "date":"24th August 2020",
               "image":"/assets/events/codingcon.jpeg",
               "event_name":"CODING CONUNDRUM",
               "description":"The I.S.E Student Club organized a Coding Contest where the participants had to solve 9 competitive programming challenges given to them in a programming language of their choice. The event was conducted on 24th August 2021. "
           }
        ]
    },
    {
        "year":"2020",
        "data": [
            {
            "date":"12th October 2020",
            "image":"/assets/iselogo.png",
            "event_name":"Cure the Code",
            "description":"The I.S.E Student Club in collaboration with IEEE chapter of BMS College of Engineering, organized A Debugging Contest where the participants had to debug 10 challenging problems given to them in C++ and JAVA. "
             },
             {
                "date":"15th February 2020",
                "image":"/assets/events/distributed.jpg",
                "event_name":"TALK ON DISTRIBUTED SYSTEMS",
                "description":"I.S.E Student Club of B.M.S. college of engineering organized a talk on DISTRIBUTED SYSTEMS on 15th of February,2020 for 2nd and 3rd year Undergraduate students .The talk was held by Aditya Kamat, who is currently working as a Site Reliability Engineering (SRE) at LinkedIn."
                 },
             {
                "date":"4th March 2020",
                "image":"/assets/events/blockchain.jpg",
                "event_name":"HANDS-ON WORKSHOP ON BLOCKCHAIN TECHNOLOGY ",
                "description":"The I.S.E Student Club in collaboration with the tech-team of BMS College of Engineering, Codelocked, organized a hands-on workshop on Blockchain technology.The main aim of the talk was to make the participants aware about the subject of blockchain and its advantages such as transaction security and ease of use."
                 }
        ]
    },
    {
        "year":"2019",
        "data": [
            {
            "date":"9th February 2019",
            "image":"/assets/events/orientation2019.png",
            "event_name":"ISE Student Club Orientation",
            "description":"The ISE Student Club Orientation was conducted on 9th February, 2019. It was held in Auditorium 2 in the new Academic block at 1:45pm. Around 130 students attended the event from 1st as well as 2nd year."
             },
             {
                "date":"21st February, 2019",
                "image":"/assets/events/codeIT.jpg",
                "event_name":"CodeIT",
                "description":"The ISE Student Body held its first event, CodeIT  open to students of our department, 36 students participated. It was held online on Hackerrank platform and lasted for 2 hours from 2:00 to 4:00 pm.During the event, participants solved easy to intermediate level problems which tested their logical, interpretational, coding and problem-solving skills. "
             },
             {
                "date":"2 March, 2019",
                "image":"/assets/events/simple_restful.jpeg",
                "event_name":"Restful Service Workshop",
                "description":"The ISE Student Body held a workshop on the topic Simple RESTful service on the 2 nd of March, 2019 in the PG Lab(5th floor, Platinum Block). The workshop was open to 6th semester V.C.S elective students of our department under the supervision of Mrs. Chandrakala G Raju. There were 20 participants for the workshop. The department had invited Mahesh H P from McKinsey who is a graduate from our College."
             },
             
             {
                "date":"25th April 2019",
                "image":"/assets/events/codeigo.png",
                "event_name":"Codigo",
                "description":"As a part of the 2nd International PES Day, the BMSCE IEEE Power and Energy Society in collaboration with the ISE Student Club, conducted a 2 hours code-a-thon in the ISE PG Lab from 2:00-4:00 on 25th April 2019. The main theme of the questions was energy optimisation and the participants had to solve 6 questions on Hackerrank Platform with a time limit of 2 hours"
             }
        ]
    }
]
